{
    "Stanford-Cars_Audi_TTS_Coupe_2012": [
        "2012 Audi TTS Coupe: Compact sports coupe with a sleek, aerodynamic design, low stance, signature LED daytime running lights, and a distinctive hexagonal front grille.",
        "2012 Audi TTS Coupe, compact luxury sports coupe with a sleek, low-profile design and aggressive front grille.",
        "Audi TTS Coupe 2012: A compact sports coupe with a sleek, rounded design and a prominent front grille."
    ],
    "Stanford-Cars_Audi_R8_Coupe_2012": [
        "2012 Audi R8 Coupe: Low-profile luxury sports car with a wide, aggressive stance, large side air intakes, and a prominent rear engine cover visible through the rear window.",
        "2012 Audi R8 Coupe, distinguished by its full LED headlights, side blades, and aerodynamic shape.",
        "Audi R8 Coupe 2012: A mid-engine supercar with low, wide stance and distinctive side blades."
    ],
    "Stanford-Cars_BMW_X6_SUV_2012": [
        "2012 BMW X6 SUV: Crossover SUV with a unique coupe-like sloping roofline, muscular wheel arches, and the iconic kidney grille flanked by sharp headlights.",
        "2012 BMW X6 SUV, features a sloping roofline that merges SUV utility with coupe aesthetics.",
        "BMW X6 SUV 2012: A large luxury SUV with a coupe-like roofline and bold front grille."
    ],
    "Stanford-Cars_Chevrolet_Corvette_Convertible_2012": [
        "2012 Chevrolet Corvette Convertible: Classic convertible with a long, sculpted hood, low and wide stance, and round tail lights, embodying a traditional American sports car aesthetic.",
        "2012 Chevrolet Corvette Convertible, notable for its sculpted hood, large front air intakes, and sporty stance.",
        "Chevrolet Corvette Convertible 2012: A low, sleek convertible sports car with a wide stance and soft-top roof."
    ],
    "Stanford-Cars_Chevrolet_Corvette_Ron_Fellows_Edition_Z06_2007": [
        "2007 Chevrolet Corvette Ron Fellows Edition Z06: Limited edition sports car with racing-inspired decals, wide fenders, and a distinctive front air intake.",
        "2007 Chevrolet Corvette Ron Fellows Edition Z06, features exclusive white paint with red accents and distinctive aerodynamic body kit.",
        "Chevrolet Corvette Ron Fellows Edition Z06 2007: A special edition sports car with wide fenders and unique racing graphics."
    ],
    "Stanford-Cars_Chevrolet_Avalanche_Crew_Cab_2012": [
        "2012 Chevrolet Avalanche Crew Cab: Pickup truck with a bold front fascia, angular body lines, integrated bed cover, and a sloped rear roofline transitioning into the cargo bed.",
        "2012 Chevrolet Avalanche Crew Cab, recognized by its unique midgate that converts the vehicle from an SUV to a full-size pickup.",
        "Chevrolet Avalanche Crew Cab 2012: A versatile full-size pickup truck with a unique mid-gate design and four full-size doors."
    ],
    "Stanford-Cars_Chrysler_Aspen_SUV_2009": [
        "2009 Chrysler Aspen SUV: Full-size SUV with a boxy silhouette, prominent chrome grille, and squared-off wheel arches, giving it a robust and commanding presence.",
        "2009 Chrysler Aspen SUV, characterized by its broad chrome grille, squared-off body, and substantial wheel arches.",
        "Chrysler Aspen SUV 2009: A mid-size luxury SUV with a boxy design and chrome-accented grille."
    ],
    "Stanford-Cars_Chrysler_Crossfire_Convertible_2008": [
        "2008 Chrysler Crossfire Convertible: Compact convertible with a distinctive boat-tail rear design, angular body lines, and a prominent front grille, reflecting retro influences.",
        "2008 Chrysler Crossfire Convertible, known for its boat tail rear end, crosshair grille, and sculpted fenders.",
        "Chrysler Crossfire Convertible 2008: A sleek two-seater convertible with a long hood and boat-tail rear-end design."
    ],
    "Stanford-Cars_Chrysler_PT_Cruiser_Convertible_2008": [
        "2008 Chrysler PT Cruiser Convertible: Retro-styled convertible with a high roofline, rounded body shape, and large, pronounced front headlights.",
        "2008 Chrysler PT Cruiser Convertible, features a distinctive retro design with rounded contours and a high roofline.",
        "Chrysler PT Cruiser Convertible 2008: A retro-styled convertible with a tall, boxy design and fold-down soft-top."
    ],
    "Stanford-Cars_Dodge_Ram_Pickup_3500_Quad_Cab_2009": [
        "2009 Dodge Ram Pickup 3500 Quad Cab: Heavy-duty pickup with a massive front grille, large, rectangular headlights, and flared rear fenders, emphasizing its rugged utility.",
        "2009 Dodge Ram Pickup 3500 Quad Cab, marked by its muscular build, prominent grille, and substantial cargo bed.",
        "Dodge Ram Pickup 3500 Quad Cab 2009: A heavy-duty pickup truck with a large quad cab and rugged, muscular design."
    ],
    "Stanford-Cars_Dodge_Charger_SRT-8_2009": [
        "2009 Dodge Charger SRT-8: Muscular sedan with a wide stance, aggressive front fascia, hood scoop, and bold rear spoiler, accentuating its performance-oriented design.",
        "2009 Dodge Charger SRT-8, features a hood scoop, aggressive front fascia, and pronounced rear spoiler.",
        "Dodge Charger SRT-8 2009: A high-performance sedan with an aggressive front end and wide stance."
    ],
    "Stanford-Cars_FIAT_500_Abarth_2012": [
        "2012 FIAT 500 Abarth: Compact hatchback with a rounded, iconic shape, sporty front bumper, and scorpion logo detailing, offering a playful yet aggressive appearance.",
        "2012 FIAT 500 Abarth, compact and curvy with a sporty bumper, dual exhaust, and distinctive badging.",
        "FIAT 500 Abarth 2012: A small, sporty hatchback with retro-inspired design and Abarth performance badging."
    ],
    "Stanford-Cars_Ford_Ranger_SuperCab_2011": [
        "2011 Ford Ranger SuperCab: Mid-size pickup truck with a straightforward, utilitarian design, featuring a squared-off front grille, rectangular headlights, and a functional extended cab.",
        "2011 Ford Ranger SuperCab, recognized by its boxy frame, extended cab, and practical bed layout.",
        "Ford Ranger SuperCab 2011: A compact pickup truck with an extended cab and rugged design."
    ],
    "Stanford-Cars_Ford_F-150_Regular_Cab_2007": [
        "2007 Ford F-150 Regular Cab: Full-size pickup with a traditional boxy design, bold front grille, and squared-off headlights, emphasizing its practicality.",
        "2007 Ford F-150 Regular Cab, notable for its large front grille, rugged design, and strong truck bed.",
        "Ford F-150 Regular Cab 2007: A full-size pickup truck with a regular cab and strong, boxy design."
    ],
    "Stanford-Cars_Ford_Fiesta_Sedan_2012": [
        "2012 Ford Fiesta Sedan: Subcompact sedan with a sleek, modern design, narrow front grille, and angular headlights, offering a contemporary urban look.",
        "2012 Ford Fiesta Sedan, features a sloping roofline, compact frame, and trapezoidal front grille.",
        "Ford Fiesta Sedan 2012: A compact sedan with a sleek, modern design and streamlined body."
    ],
    "Stanford-Cars_GMC_Canyon_Extended_Cab_2012": [
        "2012 GMC Canyon Extended Cab: Mid-size pickup with a tall, upright grille, squared-off headlights, and a slightly flared rear fender, showcasing a robust appearance.",
        "2012 GMC Canyon Extended Cab, features a rugged appearance with squared-off lines and an extended rear cabin.",
        "GMC Canyon Extended Cab 2012: A mid-size pickup truck with an extended cab and bold, squared-off design."
    ],
    "Stanford-Cars_HUMMER_H2_SUT_Crew_Cab_2009": [
        "2009 HUMMER H2 SUT Crew Cab: Large off-road vehicle with a blocky, military-inspired design, prominent front grille, high ground clearance, and chunky tires.",
        "2009 HUMMER H2 SUT Crew Cab, unmistakable with its large boxy frame, wide stance, and unique cargo bed.",
        "HUMMER H2 SUT Crew Cab 2009: A large, rugged SUV with an open bed and military-inspired boxy design."
    ],
    "Stanford-Cars_Infiniti_G_Coupe_IPL_2012": [
        "2012 Infiniti G Coupe IPL: Luxury coupe with a flowing, streamlined body, sculpted side panels, and a low, aggressive front fascia, reflecting a modern sports coupe aesthetic.",
        "2012 Infiniti G Coupe IPL, sleek with a low roofline, aggressive front bumper, and sporty dual exhaust.",
        "Infiniti G Coupe IPL 2012: A luxury sports coupe with sleek, aerodynamic design and aggressive grille."
    ],
    "Stanford-Cars_Mazda_Tribute_SUV_2011": [
        "2011 Mazda Tribute SUV: Compact SUV with a traditional, upright stance, trapezoidal grille, and slightly flared wheel arches, designed for a balanced, practical appearance.",
        "2011 Mazda Tribute SUV, characterized by a conservative design with rounded edges and a modest grille.",
        "Mazda Tribute SUV 2011: A compact SUV with a boxy design and functional roof rails."
    ],
    "Stanford-Cars_Mercedes-Benz_C-Class_Sedan_2012": [
        "2012 Mercedes-Benz C-Class Sedan: Luxury sedan with a refined, elegant design, featuring a sculpted hood, narrow headlights, and a distinctive three-pointed star on the grille.",
        "2012 Mercedes-Benz C-Class Sedan, features a refined grille, balanced proportions, and sleek side sculpting.",
        "Mercedes-Benz C-Class Sedan 2012: A compact luxury sedan with refined design and prominent front grille."
    ],
    "Stanford-Cars_Mitsubishi_Lancer_Sedan_2012": [
        "2012 Mitsubishi Lancer Sedan: Compact sedan with sharp, angular lines, a narrow front grille, and aggressive front bumper, evoking a sporty, rally-inspired look.",
        "2012 Mitsubishi Lancer Sedan, recognizable by its sharp front end with distinctive rally-inspired air intakes.",
        "Mitsubishi Lancer Sedan 2012: A compact sedan with an aggressive front end and sporty design cues."
    ],
    "Stanford-Cars_Nissan_240SX_Coupe_1998": [
        "1998 Nissan 240SX Coupe: Classic sports coupe with a low, sleek profile, pop-up headlights, and a smooth, rounded rear end, capturing the essence of late 90s design.",
        "1998 Nissan 240SX Coupe, classic sports car silhouette with a smooth, low profile and pop-up headlights.",
        "Nissan 240SX Coupe 1998: A compact, rear-wheel-drive coupe with a sleek design and pop-up headlights."
    ],
    "Stanford-Cars_Plymouth_Neon_Coupe_1999": [
        "1999 Plymouth Neon Coupe: Compact coupe with a rounded, bulbous body shape, large round headlights, and a simplistic, utilitarian design.",
        "1999 Plymouth Neon Coupe, compact and economical with a simple, straightforward body line.",
        "Plymouth Neon Coupe 1999: A compact, front-wheel-drive coupe with a rounded, minimalist design."
    ],
    "Stanford-Cars_Rolls-Royce_Phantom_Sedan_2012": [
        "2012 Rolls-Royce Phantom Sedan: Ultra-luxury sedan with an imposing, squared-off front grille, long wheelbase, and smooth, flowing body lines, embodying opulence and prestige.",
        "2012 Rolls-Royce Phantom Sedan, opulent with a massive grille, upright stance, and classic luxury design.",
        "Rolls-Royce Phantom Sedan 2012: A full-size luxury sedan with imposing presence and rear-hinged coach doors."
    ],
    "Stanford-Cars_Spyker_C8_Coupe_2009": [
        "2009 Spyker C8 Coupe: Exotic sports car with an aerodynamic, low-slung body, large front air intakes, and a distinctive glass canopy roof, highlighting its unique design.",
        "2009 Spyker C8 Coupe, exotic with a low, wide stance, aerodynamic curves, and distinctive cockpit-like canopy.",
        "Spyker C8 Coupe 2009: A rare, exotic sports car with striking design and aviation-inspired details."
    ],
    "Stanford-Cars_Toyota_Sequoia_SUV_2012": [
        "2012 Toyota Sequoia SUV: Large SUV with a broad, muscular body, oversized grille, and large, rectangular headlights, giving it a commanding road presence.",
        "2012 Toyota Sequoia SUV, robust with a massive front end, bulky contours, and large wheel arches.",
        "Toyota Sequoia SUV 2012: A full-size SUV with a muscular design and three rows of seating."
    ],
    "Stanford-Cars_Toyota_4Runner_SUV_2012": [
        "2012 Toyota 4Runner SUV: Mid-size SUV with a rugged, boxy design, prominent front bumper, and high ground clearance, emphasizing its off-road capability.",
        "2012 Toyota 4Runner SUV, rugged with a boxy frame, integrated roof rails, and a tailgate-mounted spare tire.",
        "Toyota 4Runner SUV 2012: A mid-size SUV with rugged, off-road-ready design and boxy body."
    ],
    "Stanford-Cars_Volkswagen_Golf_Hatchback_2012": [
        "2012 Volkswagen Golf Hatchback: Compact hatchback with a clean, simple design, featuring a sloping roofline, narrow headlights, and a wide rear hatch.",
        "2012 Volkswagen Golf Hatchback, compact and functional with a clean design, rounded corners, and iconic hatchback shape.",
        "Volkswagen Golf Hatchback 2012: A compact hatchback with a clean, minimalist design and practical five-door layout."
    ],
    "Stanford-Cars_Volvo_C30_Hatchback_2012": [
        "2012 Volvo C30 Hatchback: Compact hatchback with a distinctive, rounded rear end, large rear window, and sharp, angular side profile, offering a modern, stylish look.",
        "2012 Volvo C30 Hatchback, distinct with a unique rear glass hatch, compact design, and modern aesthetic lines.",
        "Volvo C30 Hatchback 2012: A compact hatchback with distinctive rear-end and large glass hatch."
    ]
}
